sarniva/edge_wake_dataset/sdkconfig.defaults
# Dataset recorder: console over NATIVE USB (USB-Serial/JTAG), not UART.
# Baud is ignored by USB-CDC; open the port at any baud (e.g. 115200).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Dataset tool hogs CPU0 by design during ~2 MB dumps (with yields, but not
# enough IDLE time for the idle watchdog). Disable the IDLE checks; the MAIN
# task stays subscribed + fed in all long loops, so real hangs still trip it.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
